tap "caskroom/cask"
tap "caskroom/fonts"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-versions"
brew "azure-cli"
brew "direnv"
brew "git"
brew "git-lfs"
brew "hub"
brew "jq"
brew "nvm"
brew "rbenv"
brew "go"
cask "dotnet-sdk"

if (/darwin/ =~ RUBY_PLATFORM) != nil 
  brew "mas"
  cask "font-fira-code"
  cask "font-fira-mono-for-powerline"
  cask "visual-studio-code-insiders"
  cask "notion"
  cask "google-chrome"
  cask "microsoft-teams"
  cask "zoomus"
  cask "deckset"
  cask "numi"
  cask "expressvpn"

  mas "Speedtest", id: 1153157709
  mas "Ulysses", id: 1225570693
  mas "Pixelmator Pro", id: 1289583905
  mas "1Password", id: 1333542190
  mas "Linea Link", id: 1233368267
  mas "Keynote", id: 409183694
  mas "Agenda", id: 1287445660
  mas "WiFi Explorer", id: 494803304
  mas "Slack", id: 803453959
  mas "Reeder", id: 1449412482
end