tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"
brew "azure-cli"
brew "direnv"
brew "git"
brew "git-lfs"
brew "jq"
brew "vips"
brew "node"

if (/darwin/ =~ RUBY_PLATFORM) != nil 
  brew "mas"
  cask "font-cascadia"
  cask "font-jetbrains-mono"
  cask "adobe-creative-cloud"
  cask "visual-studio-code-insiders"
  cask "notion"
  cask "deckset"
  cask "numi" 
  cask "microsoft-teams"
  cask "vlc"

  mas "Speedtest", id: 1153157709
  mas "Ulysses", id: 1225570693
  mas "Pixelmator Pro", id: 1289583905
  mas "1Password", id: 1333542190
  mas "Linea Link", id: 1233368267
  mas "Keynote", id: 409183694
  mas "Agenda", id: 1287445660
  mas "WiFi Explorer", id: 494803304
  mas "Slack", id: 803453959
  mas "Reeder", id: 1449412482
  mas "Xcode", id: 497799835
  mas "Blackmagic Disk Speed Test", id: 425264550
  mas "Final Cut Pro", id: 424389933
  mas "Motion", id: 434290957
  mas "Compressor", id: 424390742
end
